SupportHelp/app/controllers/priorities_controller.rb

SELECT "priorities".* FROM "priorities"
---
  def index
    @priorities = Priority.all