SupportHelp/app/controllers/systems_controller.rb

SELECT "systems".* FROM "systems"
---
  def index
    @systems = System.all