SupportHelp/app/controllers/tickets_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def new
    @system = System.actives
    @priority = Priority.actives
    @subject = Subject.all

SELECT  "statuses".* FROM "statuses"  ORDER BY "statuses"."id" ASC LIMIT 1
INSERT INTO "tickets" ("title", "system_id", "subject_id", "priority_id", "client_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Oas"], ["system_id", 3], ["subject_id", 9], ["priority_id", 3], ["client_id", 3], ["created_at", "2015-02-22 01:28:36.830140"], ["updated_at", "2015-02-22 01:28:36.830140"]]
---
  def create
    @ticket = Ticket.new(ticket_params)
    unless current_user.analyst?
      @ticket.status_id = Status.first.id
    end
    @ticket.save